dict_data_cdng = {
    'АЦДНГ 01':
        'Диспетчер АЦДНГ 01 (DISP-ACDNG1@bn.rosneft.ru) +7 (34783) 79722',
    "АЦДНГ 02":
        'Диспетчер АЦДНГ 02 (Disp-ACDNG2@bn.rosneft.ru) +7 (34783) 78827',
    "АЦДНГ 03":
        'Диспетчер АЦДНГ 03 (Disp-ACDNG3@bn.rosneft.ru) +7 (34783) 77357',
    "АЦДНГ 04":
        'Диспетчер АЦДНГ 04 (Disp-ACDNG4@bn.rosneft.ru) +7 (34783) 78518',
    "АЦДНГ 05":
        'Диспетчер АЦДНГ 05 (Disp_ACDNG5@bn.rosneft.ru) +7 (34783) 78537',

    'АЦДНГ 06':
        'Диспетчер АЦДНГ 06 (Disp-ACDNG6@bn.rosneft.ru) +7 (34783) 79766',
    'КЦДНГ 01':
        'Диспетчер КЦДНГ 01 (DispKCDNG1@bn.rosneft.ru) +7 (34760) 72618',
    'КЦДНГ 02':
        'Диспетчер КЦДНГ 02 (disp2kudng@bn.rosneft.ru) +7 (34760) 72221',
    'КЦДНГ 03':
        'Диспетчер КЦДНГ 03 (DispKCDNG3@bn.rosneft.ru) +7 (34760) 72419',
    'КЦДНГ 04':
        'Диспетчер КЦДНГ 04 (dispcdng4@bn.rosneft.ru) +7 (34760) 71615',
    'КЦДНГ 05':
        'Диспетчер КЦДНГ 05 (disp5kudng@bn.rosneft.ru) +7 (34760) 71129',
    'КЦДНГ 06':
        'Диспетчер КЦДНГ 06 (disp6kudng@bn.rosneft.ru) +7 (34760) 71507',
    'КЦДНГ 07':
        'Диспетчер КЦДНГ 07 (changakul@bn.rosneft.ru) +7 (34760) 71120',
    'КЦДНГ 08':
        'Диспетчер КЦДНГ 08 (changakul@bn.rosneft.ru) +7 (34760) 71120',
    'ЮЦДНГ 01':
        'Диспетчер ЮЦДНГ 01 (DISP-UCDNG1@bn.rosneft.ru) +7 (34783) 76314',
    'ЮЦДНГ 02':
        'Диспетчер ЮЦДНГ 02 (DISP-UCDNG2@bn.rosneft.ru) +7 (34783 76309',
    'ЮЦДНГ 03':
        'Диспетчер ЮЦДНГ 03 (DISP-UCDNG3@bn.rosneft.ru) +7 (34783 76445',
    'ЮЦДНГ 04':
        'Диспетчер ЮЦДНГ 04 (DISP-UCDNG4@bn.rosneft.ru) +7 (34783) 76200 ',
    'АкЦДНГ 01':
        'Диспетчер АкЦДНГ 01  +7 (34786) 38832 (DispACDNG1@bn.rosneft.ru)',
    "АкЦДНГ 02":
        'Диспетчер АкЦДНГ 02 НГДУ "Ишимбайнефть" (DispACDNG2@bn.rosneft.ru) +7 (34786) 38387',
    "АкЦДНГ 03":
        'Диспетчер АкЦДНГ 03 НГДУ "Ишимбайнефть" (DispACDNG3@bn.rosneft.ru) +7 (34786) 37503',
    "ИЦДНГ 01":
        'Диспетчер ИЦДНГ 01 (DispICdng1@bn.rosneft.ru) +7 (34794) 68939',
    "ИЦДНГ 02":
        'Диспетчер ИЦДНГ 02 (DispICdng2@bn.rosneft.ru) +7 (34794) 68009',
    "ИЦДНГ 03":
        'Диспетчер ИЦДНГ 03 (DispICdng3@bn.rosneft.ru) +7 (34794) 68636',
    "ИЦДНГ 04":
        'Диспетчер ИЦДНГ 04 (DispICdng4@bn.rosneft.ru) +7 (34794) 68549',
    "ИЦДНГ 05":
        'Диспетчер ИЦДНГ 05 (DispICdng5@bn.rosneft.ru) +7 (34794) 68810',
    "ШЦДНГ":
        'Диспетчер ШЦДНГ +7 (34786) 38932',
    "ШЦДНГ":
        'Диспетчер ШЦДНГ +7 (34786) 38132',
    "ЧЦДНГ 01":
        'Диспетчерская  ЧЦДНГ 01 (dispet1@bn.rosneft.ru) +7 (34787 41302',
    "ЧЦДНГ 02":
        'Диспетчерская  ЧЦДНГ 02 (dispet2@bn.rosneft.ru) +7 (34787) 43740',
    "ЧЦДНГ 03":
        'Диспетчерская  ЧЦДНГ 03 (dispet3@bn.rosneft.ru) +7 (34787) 41384',
    "ЧЦДНГ 04":
        'Диспетчерская  ЧЦДНГ 04 (DispetChn4@bn.rosneft.ru) +7 (34787) 41232',
    "ЧЦДНГ 05":
        'Диспетчерская  ЧЦДНГ 05 (dispet5@bn.rosneft.ru) (34787) 41302',
    "УЦДНГ 01":
        'Диспетчер УЦДНГ 01  (DispetUCDNG-1@bn.rosneft.ru) +7 (347) 26-212-42',
    "УЦДНГ 02":
        'Диспетчер УЦДНГ 02 (DispetUCDNG-2@bn.rosneft.ru) +7 (347) 26-279-66; 8-(347) 262-15-80',
    "УЦДНГ 03":
        'Диспетчер УЦДНГ 03 (DispetUCDNG-3a@bn.rosneft.ru) +7 (347) 26-215-42',
    "УЦДНГ 04":
        'Диспетчер УЦДНГ 04 (DispetUCDNG-4@bn.rosneft.ru) 8-347-262-1548',
    "УЦДНГ 05":
        'Диспетчер УЦДНГ 05 (dispetucdng-5@bn.rosneft.ru) +7 (347) 262-1590',
    "ОЦДНГ 01":
        'Диспетчер ОЦДНГ 01 (DispetOTSDNG-1@bn.rosneft.ru) +7 (34782) 91352',
    "ОЦДНГ 02":
        'Диспетчер ОЦДНГ 02 (Dispetotsdng-2@bn.rosneft.ru) +7 (34782) 91543',
    "ОЦДНГ 03":
        'Диспетчер ОЦДНГ 03 (DispetOTSDNG-3@bn.rosneft.ru) +7 (34782) 91100',
    "ТЦДНГ 01":
        'Диспетчер ТЦДНГ 01 (DispetTCDNG1@bn.rosneft.ru) +7 (34767) 94338',
    "ТЦДНГ 02":
        'Диспетчер ТЦДНГ 02 (DispetTCDNG2@bn.rosneft.ru) +7 (34767) 94752',
    "ТЦДНГ 03":
        'Диспетчер ТЦДНГ 03 (DispetTCDNG3@bn.rosneft.ru) +7 (34767) 94222',
    "ТЦДНГ 04":
        'Диспетчер ТЦДНГ 04 (dispetTCDNG4@bn.rosneft.ru) +7 (34767) 94610'
}


def calc_pntzh(fluid, cdng):
    # print(f'ррррр {fluid,cdng}')

    if cdng in ["ТЦДНГ 04", "ТЦДНГ 03", "ТЦДНГ 02", "ТЦДНГ 01", "ОЦДНГ 02", "ОЦДНГ 01", "ОЦДНГ 03"]:
        if fluid > 1.18:
            return 'ПНТЖ РСУ в г. Туймазы',
        elif fluid == 1.18:
            return 'ПНТЖ "Туркменево"  скв. 1576, тех жидкость уд. вес 1,18 г/см3',
        elif fluid == 1.01:
            return 'Котельная №2, тех жидкость уд. вес 1,00 г/см3',
        else:
            return 'ПНТЖ "Туркменево"  скв. 1576, тех жидкость уд. вес 1,18 г/см3', \
                   'Котельная №2, тех жидкость уд. вес 1,00 г/см3'
    elif cdng in ['АЦДНГ 01', "АЦДНГ 02", "АЦДНГ 03", "АЦДНГ 04", 'АЦДНГ 06']:
        if fluid > 1.18:
            return 'ПНТЖ Крезол',
        elif fluid == 1.18:
            return 'ПНТЖ "Ташкиново" соленая 1,18',
        elif fluid == 1.01:
            return 'ПНТЖ "Ташкиново" пресная 1',
        else:
            return 'ПНТЖ "Ташкиново" соленая 1,18', 'ПНТЖ "Ташкиново" пресная 1'
    elif cdng in ['КЦДНГ 01', 'КЦДНГ 02', 'КЦДНГ 03', 'КЦДНГ 04', 'КЦДНГ 05']:
        if fluid > 1.18:
            return 'ПНТЖ Крезол',
        elif fluid == 1.18:
            return 'ПНТЖ "Каймаш" соленая 1,17',
        elif fluid == 1.01:
            return 'ПНТЖ "Четырманово"  пресная 1',
        else:
            return 'ПНТЖ "Каймаш" соленая 1,17', 'ПНТЖ "Четырманово"  пресная 1'
    elif cdng in ['КЦДНГ 06']:
        if fluid > 1.18:
            return 'ПНТЖ Крезол',
        elif fluid == 1.18:
            return 'ПНТЖ "УПС-Биаваш"  соленая 1,15',
        elif fluid == 1.01:
            return 'ПНТЖ "Четырманово"  пресная 1',
        else:
            return 'ПНТЖ "УПС-Биаваш"  соленая 1,18', 'ПНТЖ "Четырманово"  пресная 1'
    elif cdng in ['КЦДНГ 07']:
        if fluid > 1.18:
            return 'ПНТЖ Крезол',
        elif fluid == 1.18:
            return 'ПНТЖ "УПС-7" Байсар соленая 1,18',
        elif fluid == 1.01:
            return 'ПНТЖ "Четырманово"  пресная 1',
        else:
            return 'ПНТЖ "УПС-7" Байсар соленая 1,18', 'ПНТЖ "Четырманово"  пресная 1'
    elif cdng in ['КЦДНГ 08']:
        if fluid > 1.18:
            return 'ПНТЖ Крезол',
        elif fluid == 1.18:
            return 'ПНТЖ "УПС-7" Байсар соленая 1,18',
        elif fluid == 1.01:
            return 'ПНТЖ "Четырманово"  пресная 1',
        else:
            return 'ПНТЖ "УПС-7" Байсар соленая 1,18', 'ПНТЖ "Четырманово"  пресная 1'
    elif cdng in ['ЮЦДНГ 01', 'ЮЦДНГ 02', 'ЮЦДНГ 03', 'ЮЦДНГ 04']:
        if fluid > 1.18:
            return 'ПНТЖ Крезол',
        elif fluid == 1.18:
            return 'ПНТЖ "Кариево" скв. 8007 соленая 1,18"',
        elif fluid == 1.01:
            return 'ПНТЖ "Ташкиново" пресная 1',
        else:
            return 'ПНТЖ "Кариево" скв. 8007 соленая 1,18"', 'ПНТЖ "Ташкиново" пресная 1'
    elif cdng in ['АкЦДНГ 01', "АкЦДНГ 02", "АкЦДНГ 03"]:
        if fluid > 1.18:
            return 'ПНТЖ Крезол',
        elif fluid == 1.18:
            return 'ПНТЖ "Раевка" скв. 311 соленая 1,18',
        elif fluid == 1.01:
            return 'ПНТЖ "Степановка" пресная 1',
        else:
            return 'ПНТЖ "Раевка" скв. 311 соленая 1,18', 'ПНТЖ "Степановка" пресная 1'
    elif cdng in ["ИЦДНГ 01", "ИЦДНГ 02", "ИЦДНГ 03", "ИЦДНГ 04", "ИЦДНГ 05"]:
        if fluid > 1.18:
            return 'ПНТЖ Крезол',
        elif fluid == 1.18:
            return 'ПНВ 37 "Искандерово" скв. 43 соленая 1,18',
        elif fluid == 1.01:
            return 'ПНТЖ "Казангулово" пресная 1',
        else:
            return 'ПНВ 37 "Искандерово" скв. 43 соленая 1,18', 'ПНТЖ "Казангулово" пресная 1'
    elif cdng in ["ШЦДНГ"]:
        if fluid > 1.18:
            return 'ПНТЖ Крезол',
        elif fluid == 1.18:
            return 'ПНТЖ "Знаменка" скв. 354 соленая 1,18',
        elif fluid == 1.01:
            return 'ПНТЖ "Шкапово" пресная 1',
        else:
            return 'ПНТЖ "Знаменка" скв. 354 соленая 1,18', 'ПНТЖ "Шкапово" пресная 1'
    elif cdng in ["ЧЦДНГ 02"]:
        if fluid > 1.18:
            return 'ПНТЖ Крезол',
        elif fluid == 1.18:
            return 'УНСВ "Менеуз" скв. 3212 соленая 1,18',
        elif fluid == 1.01:
            return 'УНПВ "Кушуль" пресная 1',
        else:
            return 'УНСВ "Менеуз" скв. 3212 соленая 1,18', 'УНПВ "Кушуль" пресная 1'
    elif cdng in ["ЧЦДНГ 01", "ЧЦДНГ 02", "ЧЦДНГ 04", "ЧЦДНГ 05"]:
        if fluid > 1.19:
            return 'ПНТЖ Крезол',
        elif fluid == 1.19:
            return 'УНСВ "Имянлекуль" скв. 1354 соленая 1,19',
        elif fluid == 1.01:
            return 'УНПВ "Тамьян" пресная 1',
        else:
            return 'УНСВ "Имянлекуль" скв. 1354 соленая 1,19', 'УНПВ "Тамьян"  пресная 1'
    elif cdng in ["ЧЦДНГ 03"]:
        if fluid > 1.19:
            return 'ПНТЖ Крезол',
        elif fluid == 1.19:
            return 'УНСВ "Имянлекуль" скв. 1354 соленая 1,19',
        elif fluid == 1.01:
            return 'УНПВ "Салпарово"  пресная 1',
        else:
            return 'УНСВ "Имянлекуль" скв. 1354 соленая 1,19', 'УНПВ "Салпарово"  пресная 1'
    elif cdng in [ "УЦДНГ 03", "УЦДНГ 04"]:
        if fluid > 1.18:
            return 'ПНТЖ Крезол',
        elif fluid == 1.18:
            return 'ПНТЖ "Правый берег" скв №431 соленая 1,18',
        elif fluid == 1.01:
            return 'ПНТЖ "Курасково" пресная 1',
        else:
            return 'ПНТЖ "Правый берег" скв №431 соленая 1,18', 'ПНТЖ "Курасково" пресная 1'
    elif cdng in [ "УЦДНГ 04"]:
        if fluid > 1.19:
            return 'ПНТЖ Крезол',
        elif fluid == 1.19:
            return 'ПНТЖ "Бекетово" скв. №221 соленая 1,197',
        elif fluid == 1.01:
            return 'ПНТЖ "Курасково" пресная 1',
        else:
            return 'ПНТЖ "Бекетово" скв. №221 соленая 1,197', 'ПНТЖ "Курасково" пресная 1'
    elif cdng in ["УЦДНГ 01"]:
        if fluid > 1.19:
            return 'ПНТЖ Крезол',
        elif fluid == 1.19:
            return 'ПНТЖ "Алаторка" скв№214 соленая 1,19',
        elif fluid == 1.01:
            return 'ПНТЖ "Курасково" пресная 1',
        else:
            return 'ПНТЖ "Алаторка" скв№214 соленая 1,19', 'ПНТЖ "Курасково" пресная 1'
    elif cdng in ["УЦДНГ 02"]:
        if fluid > 1.21:
            return 'ПНТЖ Крезол',
        elif fluid == 1.21:
            return 'ПНТЖ "Кушкуль"  Соленая скв. 100КУШ соленая 1,21',
        elif fluid == 1.01:
            return 'ПНТЖ "Кушкуль" Пресная скв. 1В пресная 1',
        else:
            return 'ПНТЖ "Кушкуль"  Соленая скв. 100КУШ соленая 1,21', 'ПНТЖ "Кушкуль" Пресная скв. 1В пресная 1'


